app/Models/VisitantesModel.php

INSERT INTO `visitantes` (`cpf`, `nascimento`, `nome`, `telefone`, `observacao`, `data_entrada`, `acampamento`, `placa`, `contato_emergencia_nome`, `contato_emergencia_telefone`) VALUES ('124.719.421-41', '1953-03-13', 'Pedro de Lara', '(11)91241-0702', '', '2023-04-19T12:26:03', 'N', 'KZY18213', 'Derci Gonçalves', '')
---
    public function inserir($dados) {
        $db = \Config\Database::connect();
        //$sql = file_get_contents(__DIR__ . '\SQL\Visitantes_excluir.sql');

        if($db->table($this->table)->insert($dados)){

UPDATE `visitantes` SET `codigo` = '2', `cpf` = '123.012.334-58', `nascimento` = '1989-04-21', `nome` = 'Pablo Neruda do Brasil', `telefone` = '(12)98752-1236', `observacao` = 'sem obs', `data_entrada` = '2023-04-08T10:56', `acampamento` = 'S', `placa` = 'BKL-7882', `contato_emergencia_nome` = 'Paula', `contato_emergencia_telefone` = '(12)31635-748'
WHERE `codigo` = '2'
---
    public function update($dados) {
        $db = \Config\Database::connect();
        //$sql = file_get_contents(__DIR__ . '\SQL\Visitantes_excluir.sql');

        $table=$db->table($this->table);
        $table->where('codigo',$dados['codigo']);
        if($table->update($dados)){